In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('bank.csv', sep=';')

In [3]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [4]:
df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

#Example
df['child']=df.child.replace(to_replace=['no', 'yes'], value=[0, 1])

In [5]:
df['marital'] = df['marital'].replace(to_replace=['single','married'], value = [0,1])

In [6]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,1,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,1,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,0,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,1,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,1,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

# Another way of doing it

In [7]:
df['housing'] = df['housing'].map({'no':0, 'yes':1}.get)

In [8]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,1,primary,no,1787,0,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,1,secondary,no,4789,1,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,0,tertiary,no,1350,1,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,1,tertiary,no,1476,1,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,1,secondary,no,0,1,no,unknown,5,may,226,1,-1,0,unknown,no

In [9]:
df['loan'] = df['loan'].replace({'no':0, 'yes':1})

In [10]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,1,primary,no,1787,0,0,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,1,secondary,no,4789,1,1,cellular,11,may,220,1,339,4,failure,no
2,35,management,0,tertiary,no,1350,1,0,cellular,16,apr,185,1,330,1,failure,no
3,30,management,1,tertiary,no,1476,1,1,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,1,secondary,no,0,1,0,unknown,5,may,226,1,-1,0,unknown,no

In [11]:
df['job'].unique()

array(['unemployed', 'services', 'management', 'blue-collar',
       'self-employed', 'technician', 'entrepreneur', 'admin.', 'student',
       'housemaid', 'retired', 'unknown'], dtype=object)

In [12]:
df['job'].replace({'unknown': np.nan,
                  'management':0,
                    'technician':1,
                   'entrepreneur':2,
                   'blue-collar':3,
                   'retired':4,
                   'admin':5,
                   'services':6,
                   'self-employed':7,
                   'unemployed':8,
                   'housemaid':9,
                   'student':10}, inplace=True)

In [13]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,8,1,primary,no,1787,0,0,cellular,19,oct,79,1,-1,0,unknown,no
1,33,6,1,secondary,no,4789,1,1,cellular,11,may,220,1,339,4,failure,no
2,35,0,0,tertiary,no,1350,1,0,cellular,16,apr,185,1,330,1,failure,no
3,30,0,1,tertiary,no,1476,1,1,unknown,3,jun,199,4,-1,0,unknown,no
4,59,3,1,secondary,no,0,1,0,unknown,5,may,226,1,-1,0,unknown,no

In [14]:
df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,6,1,secondary,no,-333,1,0,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,7,1,tertiary,yes,-3313,1,1,unknown,9,may,153,1,-1,0,unknown,no
4518,57,1,1,secondary,no,295,0,0,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,3,1,secondary,no,1137,0,0,cellular,6,feb,129,4,211,3,other,no
4520,44,2,0,tertiary,no,1136,1,1,cellular,3,apr,345,2,249,7,other,no

In [15]:
df['default'].replace({'no':0,'yes':1}, inplace = True )

In [16]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,8,1,primary,0,1787,0,0,cellular,19,oct,79,1,-1,0,unknown,no
1,33,6,1,secondary,0,4789,1,1,cellular,11,may,220,1,339,4,failure,no
2,35,0,0,tertiary,0,1350,1,0,cellular,16,apr,185,1,330,1,failure,no
3,30,0,1,tertiary,0,1476,1,1,unknown,3,jun,199,4,-1,0,unknown,no
4,59,3,1,secondary,0,0,1,0,unknown,5,may,226,1,-1,0,unknown,no

In [17]:
#using the min,max feature sclaing approach

In [18]:
df['balance'] = df['balance'].apply(lambda x: (x - df['balance'].min()) / (df['balance'].max()- df['balance'].min()))

In [19]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,8,1,primary,0,0.068455,0,0,cellular,19,oct,79,1,-1,0,unknown,no
1,33,6,1,secondary,0,0.108750,1,1,cellular,11,may,220,1,339,4,failure,no
2,35,0,0,tertiary,0,0.062590,1,0,cellular,16,apr,185,1,330,1,failure,no
3,30,0,1,tertiary,0,0.064281,1,1,unknown,3,jun,199,4,-1,0,unknown,no
4,59,3,1,secondary,0,0.044469,1,0,unknown,5,may,226,1,-1,0,unknown,no

In [20]:
df['contact'].unique()

array(['cellular', 'unknown', 'telephone'], dtype=object)

In [21]:
df['contact'].replace({'unknown': np.nan, 'telephone':0,'cellular':1}, inplace=True)

In [22]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,8,1,primary,0,0.068455,0,0,1.0,19,oct,79,1,-1,0,unknown,no
1,33,6,1,secondary,0,0.108750,1,1,1.0,11,may,220,1,339,4,failure,no
2,35,0,0,tertiary,0,0.062590,1,0,1.0,16,apr,185,1,330,1,failure,no
3,30,0,1,tertiary,0,0.064281,1,1,NaN,3,jun,199,4,-1,0,unknown,no
4,59,3,1,secondary,0,0.044469,1,0,NaN,5,may,226,1,-1,0,unknown,no

In [23]:
df.month.unique()

array(['oct', 'may', 'apr', 'jun', 'feb', 'aug', 'jan', 'jul', 'nov',
       'sep', 'mar', 'dec'], dtype=object)

In [24]:
df.month = df.month.map({'oct':10, 'may':5, 'apr':4, 'jun':6, 'feb':2, 'aug':8, 'jan':1, 'jul':7, 'nov':11,
       'sep':9, 'mar':3, 'dec':12})

In [25]:
df.poutcome.unique()

array(['unknown', 'failure', 'other', 'success'], dtype=object)

In [26]:
df['poutcome'] = df['poutcome'].map({'unknown':np.nan, 'failure':0, 'other':1, 'success':2})

In [27]:
df.poutcome.unique()

array([nan,  0.,  1.,  2.])

In [28]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,8,1,primary,0,0.068455,0,0,1.0,19,10,79,1,-1,0,NaN,no
1,33,6,1,secondary,0,0.108750,1,1,1.0,11,5,220,1,339,4,0.0,no
2,35,0,0,tertiary,0,0.062590,1,0,1.0,16,4,185,1,330,1,0.0,no
3,30,0,1,tertiary,0,0.064281,1,1,NaN,3,6,199,4,-1,0,NaN,no
4,59,3,1,secondary,0,0.044469,1,0,NaN,5,5,226,1,-1,0,NaN,no

In [29]:
df['pdays'] = df['pdays'].apply(lambda x: (x - df['pdays'].min()) / (df['pdays'].max()- df['pdays'].min()))

In [30]:
df.y.replace({'no':0,'yes':1}, inplace = True)

In [31]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,8,1,primary,0,0.068455,0,0,1.0,19,10,79,1,0.000000,0,NaN,0
1,33,6,1,secondary,0,0.108750,1,1,1.0,11,5,220,1,0.389908,4,0.0,0
2,35,0,0,tertiary,0,0.062590,1,0,1.0,16,4,185,1,0.379587,1,0.0,0
3,30,0,1,tertiary,0,0.064281,1,1,NaN,3,6,199,4,0.000000,0,NaN,0
4,59,3,1,secondary,0,0.044469,1,0,NaN,5,5,226,1,0.000000,0,NaN,0

In [36]:
duration = df.iloc[:,11].values

In [48]:
duration.shape

(4521,)

In [52]:
duration = duration.reshape(1507,3)

In [54]:
duration

array([[ 79, 220, 185],
       [199, 226, 141],
       [341, 151,  57],
       ...,
       [660, 356,  45],
       [624, 329, 153],
       [151, 129, 345]], dtype=int64)

In [55]:
eigen, righeigen = np.linalg.eig(duration)

LinAlgError: Last 2 dimensions of the array must be square

In [ ]:
df.y.unique()

In [ ]:
df.duration = df.duration.apply(lambda v:(v-df.duration.min())/(df.duration.max()- df.duration.min()))

In [ ]:
df.head()

In [ ]:
df.describe()

In [ ]:
df.to_csv('bankpreprocessed.csv', index= False)

In [ ]:
df.corr()

## We see job and marital dont show up in our Correlation. Looking inside the problem now!

In [ ]:
df.dtypes

In [ ]:
df.campaign.unique()

In [ ]:
df.job.unique()

In [ ]:
df.marital.unique()

In [ ]:
df.job.replace({'admin.': 5}, inplace = True)

In [ ]:
df.job.unique()

In [ ]:
df.marital.replace({'divorced': 2}, inplace = True)

# Practicing Functions

In [ ]:
df.marital.unique()

In [ ]:
# def marital(x):
#     if x == 'single':
#         return 0 
#     elif x == 'divorced':
#         return 1
#     elif x == 'married':
#         return 2

In [ ]:
# df.marital.apply(marital)

In [ ]:
df.dtypes

In [ ]:
df.describe()

In [ ]:
df.corr()

In [ ]:
import matplotlib.pyplot as plt 
%matplotlib inline

In [ ]:
plt.matshow(df.corr())
plt.colorbar()

plt.xticks(list(range(len(df.columns))), list(df.columns), rotation= 'vertical')
plt.yticks(list(range(len(df.columns))), list(df.columns), rotation= 'horizontal')
plt.show()

In [ ]:
df.corr()['housing'].sort_values(ascending = False)

In [ ]:
df.plot.box()
plt.xticks(list(range(len(df.columns))),list(df.columns), rotation ='vertical')

In [ ]:
df.dtypes

In [ ]:
plt.plot(df.age.values)

In [ ]:
## This doesnt work better lets try a histogram better to visualize in a better way

In [ ]:
plt.hist(df.age.values)

In [ ]:
pd.plotting.scatter_matrix(df, figsize =(12,12), diagonal ='kde')
plt.show()

In [ ]:
df.plot() ## we didnt normalize the age

In [ ]:
low  = 0.01
high = 0.99 ## lets try to eliminate the outleirs
df.quantile([low,high])

In [ ]:
df.age.min() ## quantile is not the min remenber!

In [ ]:
qdf = df.quantile([low,high]) #maybe try 0.10 and 0.90 to eliminate more outliers
qdf.age

In [ ]:
df.age = df.age.apply(lambda x: x if qdf.age[low] < x < qdf.age[high] else np.nan)

In [ ]:
df.describe() ## count , mean and std has change for eliminates some of the outliers

In [ ]:
df.age.dropna(inplace=True) ## drop non numbers , to make sure

In [ ]:
df.describe()

In [ ]:
df.age.unique()

In [ ]:
df.age

In [ ]:
df.describe()

In [ ]:
plt.boxplot(df.age) ## dont know why it doesnt show up
plt.show()

In [ ]:
df.boxplot(column = ['age'])

In [ ]:
df.head()

In [ ]:
df.cov()

In [ ]:
# more techniques to see patterns in data

In [ ]:
from pandas.plotting import andrews_curves  ##  use it for more that 2 variables
andrews_curves(df,'y')
plt.show()

In [ ]:
df.dtypes

In [ ]:
df.plot(subplots=True, figsize=(20,20)) ##indivual plots of the data. to see the range of values

In [ ]:
pd.plotting.parallel_coordinates(df,'y',colormap ='winter' ) ## need to be fit

In [ ]:
df.dtypes

In [ ]:
df.day.unique()

In [ ]:
plt.hist(df.balance.values)

In [ ]:
df.plot.kde(subplots=True,figsize=(20,20)) ##see normal distribution 
plt.show()

In [ ]:
df.plot.hist(subplots = True, figsize =(60,60))